Update docs for integration tests and diagrams
